#Jay QH and Ben Hearon
#slots
#make a slot machine

#init

import random

#functions

def slots():
    crd = 0
    frst = input("You need to deposit some credits. Would you like to put in 20, 50, or 100?: ")
    if int(frst) == 20:
        crd = crd + 20
        print(crd)
    elif int(frst) == 50:
        crd = crd + 50
        print(crd)
    elif int(frst) == 100:
        crd = crd +100
        print(crd)
    while True:
        r1 = ["7", "7", "7", "7", "7", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡"]
        r2 = ["7", "7", "7", "7", "7", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡"]
        r3 = ["7", "7", "7", "7", "7", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡"]
        int1 = random.choice(r1)
        int2 = random.choice(r2)
        int3 = random.choice(r3)
        stt = input("Would you like to spin the wheel or deposit money? (S/D): ")
        if stt == "S":
            crd = crd - 10
            print(f"Your spin is: {int1} {int2} {int3}")
        elif stt == "D":
            frst = input("You need to deposit some credits. Would you like to put in 20, 50, or 100?: ")
            if int(frst) == 20:
                crd = crd + 20
                print(crd)
            elif int(frst) == 50:
                crd = crd + 50
                print(crd)
            elif int(frst) == 100:
                crd = crd + 100
                print(crd)
        if int1 == 7 and int2 == 7 and int3 == 7:
            print("Congratulations! You hit the jackpot.")
            crd = crd + 550
            ans = input("Would you like to spin again, quit, or check your balance? (S/Q/CD): ")
            if ans == "Q":
                break
            elif ans == "S":
                print("Time to spin again!")
            elif ans == "CD":
                print(crd)
                ans = input("Would you like to spin again or quit? (S/Q): ")
                if ans == "Q":
                    break
                else:
                    print("Time to spin again!")
        elif int1 == "♫" and int2 == "♫" and int3 == "♫":
            print("You won the mini jackpot!")
            crd = crd + 150
            ans = input("Would you like to spin again, quit, or check your balance? (S/Q/CD): ")
            if ans == "Q":
                break
            elif ans == "S":
                print("Time to spin again!")
            elif ans == "CD":
                print(crd)
                ans = input("Would you like to spin again or quit? (S/Q): ")
                if ans == "Q":
                    break
                else:
                    print("Time to spin again!")

        elif int1 == "❄" and int2 == "❄" and int3 == "❄":
            print("You won snowflakes!")
            crd = crd + 95
            ans = input("Would you like to spin again, quit, or check your balance? (S/Q/CD): ")
            if ans == "Q":
                break
            elif ans == "S":
                print("Time to spin again!")
            elif ans == "CD":
                print(crd)
                ans = input("Would you like to spin again or quit? (S/Q): ")
                if ans == "Q":
                    break
                else:
                    print("Time to spin again!")

        elif int1 == "🂡" and int2 == "🂡" and int3 == "🂡":
            print("You won cards!")
            crd = crd + 60
            ans = input("Would you like to spin again, quit, or check your balance? (S/Q/CD): ")
            if ans == "Q":
                break
            elif ans == "S":
                print("Time to spin again!")
            elif ans == "CD":
                print(crd)
                ans = input("Would you like to spin again or quit? (S/Q): ")
                if ans == "Q":
                    break
                else:
                    print("Time to spin again!")

        else:
            print("You lose, sorry.")
            ans = input("Would you like to spin again, quit, or check your balance? (S/Q/CD): ")
            if ans == "Q":
                break
            elif ans == "S":
                print("Time to spin again!")
            elif ans == "CD":
                print(crd)
                ans = input("Would you like to spin again or quit? (S/Q): ")
                if ans == "Q":
                    break
                else:
                    print("Time to spin again!")
            if crd < 10 or crd < 0:
                print("You lost all your money :(")
                break

def simulate():
        spent = 0
        won = 0
        for i in range(1000):
            r1 = ["7", "7", "7", "7", "7", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡"]
            r2 = ["7", "7", "7", "7", "7", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡"]
            r3 = ["7", "7", "7", "7", "7", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "♫", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "❄", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡", "🂡"]
            int1 = random.choice(r1)
            int2 = random.choice(r2)
            int3 = random.choice(r3)
            print(f"Your spin is: {int1} {int2} {int3}")
            spent = spent + 10
            if int1 == 7 and int2 == 7 and int3 == 7:
                won = won + 550
            elif int1 == "♫" and int2 == "♫" and int3 == "♫":
                won = won + 150
            elif int1 == "❄" and int2 == "❄" and int3 == "❄":
                won = won + 95
            elif int1 == "🂡" and int2 == "🂡" and int3 == "🂡":
                won = won + 60
            else:
                won = won
        profit = spent - won
        print(f"Player spent: {spent}")
        print(f"Player won: {won}")
        print(f"Casino profit: {profit}")



#main
slots()
